app/controllers/blogs_controller.rb

SELECT * FROM `blogs` ORDER BY created_at DESC
---
  def index
    @blogs = Blog.all(:order => "created_at DESC")

SELECT * FROM `blogs` WHERE (`blogs`.`id` = 1)
SELECT * FROM `comments` WHERE (`comments`.blog_id = 1) ORDER BY created_at DESC
---
  def show
    @blog = Blog.find(params[:id])
    @blog_comments = []
    @blog.comments.all(:order => "created_at DESC").each do |c|

SELECT * FROM "blogs" WHERE ("blogs"."id" = 2)
---
  def edit
    @blog = Blog.find(params[:id])

INSERT INTO "blogs" ("rating", "created_at", "title", "updated_at", "user_id", "content") VALUES(0, '2011-04-29 05:23:49', 'Committed to our ties with IAF: Lockheed', '2011-04-29 05:23:49', 0, 'America’s top defence sector manufacturer Lockheed Martin has said it remains committed to its relationship with the Indian Air Force despite losing out on India’s multi-billion dollar combat fighter deal.
---
  def create
    @blog = Blog.new(params[:blog])
    @blog.user_id = current_user.id
    @blog.rating = 0

    respond_to do |format|
      if @blog.save

SELECT * FROM "blogs" WHERE ("blogs"."id" = 1)
UPDATE "blogs" SET "updated_at" = '2011-04-29 05:35:06', "title" = ' US pressure fails to pull its fighter through IAF test', "content" = 'NEW DELHI: From a US versus Europe battle, it has become a Europe versus France tussle. The US did mount a high-voltage campaign over the last four years, with even President Barack Obama making a strong sales pitch for American fighters in the final stages but in the end India went "purely" by the gruelling technical evaluation.
---
  def update
    @blog = Blog.find(params[:id])

    respond_to do |format|
      if @blog.update_attributes(params[:blog])

SELECT * FROM "blogs" WHERE ("blogs"."id" = 3)
DELETE FROM "blogs" WHERE "id" = 3
---
  def destroy
    @blog = Blog.find(params[:id])
    @blog.destroy

SELECT * FROM `blogs` WHERE (`blogs`.`id` = 2)
UPDATE `blogs` SET `updated_at` = '2011-05-02 11:12:38', `rating` = 1 WHERE `id` = 2
---
  def inc_rating
    @blog = Blog.find(session[:blog_id])
    @blog.rating += 1
    @blog.save