app/controllers/comments_controller.rb

SELECT * FROM "comments"
---
  def index
    @comments = Comment.all

SELECT * FROM "comments" WHERE ("comments"."id" = 1)
---
  def show
    @comment = Comment.find(params[:id])

SELECT * FROM "blogs" WHERE ("blogs"."id" IS NULL) LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
INSERT INTO "comments" ("created_at", "updated_at", "blog_id", "user_id", "content") VALUES('2011-04-29 06:37:42', '2011-04-29 06:37:42', 5, 0, 'oh nooooooooooooo
UPDATE `users` SET `updated_at` = '2011-05-02 07:00:17', `perishable_token` = 'mhjQMxud6JVTqmxiJLGM', `last_request_at` = '2011-05-02 07:00:17' WHERE `id` = 1
---
  def create
    @comment = Comment.new(:content => params[:content])
    #@comment.content = params[:content]
    if current_user != nil
      @comment.user_id = current_user.id;
    else
      redirect_to new_user_session_path
      return
    end
    @comment.blog_id = session[:blog_id]
    @blog_root_comments = []
    Blog.find_by_id(@comment.blog_id).comments.all(:order => "created_at DESC").each do |c|
      @blog_root_comments << c if c.root?
    end
    @top = @blog_root_comments.count
    @top = (@top.even?) ? 0 : 1

    respond_to do |format|
      if @comment.save