app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('3vzrjtenK9cSMpQrz9l', '2011-05-02 06:58:08', '2011-05-02 06:58:08', 'fa755294353efe00e75feca8aaea5c7ecc0666593cfd9663e99331cf408e8c6f097b6f5ba4939e47e826c666d85532ec6409128f084a9a0f34fbd59b636506bd', '3VH8RUpJFwziG5MDBBjf', '2011-05-02 06:58:08', 0, '127.0.0.1', 'zhdrBmysjyH8gKrSkWjA', '2011-05-02 06:58:08', '49c0209646811c595b5433ded4c5cdeacca9179e7af59d1224a52809130335c3f380e9fbfb1df5cb1ed4763ae477c06277eafea938c0c0c04be0d8f9cd1239e4', 1, NULL, 'anandm', NULL, 'anand@anand.com')